import React from "react";
import Button from "react-bootstrap/Button";
import Card from "react-bootstrap/Card";


const UsersCard = ({ item ,setClicked,clicked}) => {
  return (
    <Card>
    <Card.Img src="https://img.freepik.com/premium-vector/popular-social-network-logo-social-network-sign-flat-social-media-icons-realistic-set-ui-ux-white-user-interface-logo_399089-889.jpg?w=2000"/>
    <Card.Body>
      <Card.Text>
      --------------------------------------------------------------------------------Если вы хотите связаться со мной в Instagram то можете перейти по ссылке:
       https://www.instagram.com/bakytbecovich_/-------------------------------------------------------------------
       --------------------------------------------------------------------------------Если вы хотите связаться со мной в Faceebook то можете перейти по ссылке:
       https://www.facebook.com/profile.php?id=100026383608427--------------------------------------------------
       --------------------------------------------------------------------------------Если вы хотите связаться со мной в Telegram то можете найти меня вбив в поиск:
       @bakytbecovich-----------------------------------------------------------------------------------------------------
       --------------------------------------------------------------------------------Если вы хотите связаться со мной в Twitter то можете найти меня вбив в поиск:
       @f3wly---------------------------------------------------------------------------------------------------------------------------------
       --------------------------------------------------------------------------------Если вы хотите связаться со мной в VK то можете найти меня вбив в поиск:
       Talantbecov Aidar-----------------------------------------------------------------------------------------------------------
       --------------------------------------------------------------------------------Если вы хотите посмотреть мои проекты то можете сделать это через Git Hub:
       https://github.com/TalantbecovAidar-----------------------------------------------------------------------------------
       
      </Card.Text>
    </Card.Body>
  </Card>


  )

  ;
};

export default UsersCard;